{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_6", "layers": [{"class_name": "Dense", "config": {"name": "FC", "trainable": true, "batch_input_shape": [null, null, 100], "dtype": "float32", "units": 524288, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "target_shape": [32, 32, 512]}}, {"class_name": "Conv2DTranspose", "config": {"name": "deconv3", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "deconv2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "deconv1", "trainable": true, "filters": 3, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "FC/kernel", "shape": [100, 524288], "dtype": "float32", "quantization": {"min": -0.9499596871581731, "scale": 0.007089251396702785, "dtype": "uint8"}}, {"name": "FC/bias", "shape": [524288], "dtype": "float32", "quantization": {"min": -0.7023030299766391, "scale": 0.005486742421692493, "dtype": "uint8"}}, {"name": "deconv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"min": -0.39472774313945397, "scale": 0.002703614679037356, "dtype": "uint8"}}, {"name": "deconv1/bias", "shape": [3], "dtype": "float32", "quantization": {"min": 0.4312666058540344, "scale": 0.00017716347002515607, "dtype": "uint8"}}, {"name": "deconv2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -2.017717519227196, "scale": 0.010347269329370237, "dtype": "uint8"}}, {"name": "deconv2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -1.405471145405489, "scale": 0.008569946008570055, "dtype": "uint8"}}, {"name": "deconv3/kernel", "shape": [2, 2, 128, 512], "dtype": "float32", "quantization": {"min": -0.743525489989449, "scale": 0.004200708982991237, "dtype": "uint8"}}, {"name": "deconv3/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.25414463865990733, "scale": 0.005776014514997894, "dtype": "uint8"}}]}]}
